Repository: eliasasskali/TriGuide
Catalog: TriGuide/Common/Localization/Sources/Resources/Localizable.xcstrings
Source language: en
Languages: ca, es

# accessibility_hints_disabled
source: Disabled
ca: Desactivat
es: Desactivado

# accessibility_hints_loading
source: Loading
ca: Carregant
es: Cargando

# accessibility_hints_tap-to
source: Tap to %@
ca: Premeu per %@
es: Pulse para %@

source: Add to favorites
ca: Afegeix als preferits
es: Añadir a favoritos

# athlete_profile-title
source: My Athlete Profile
ca: El Meu Perfil d'Atleta
es: Mi Perfil de Atleta

source: Cancel
ca: Cancela
es: Cancelar

# carbItemForm_edit_carb_item
source: Edit Carbohydrate
ca: Editar Hidrat de Carboni
es: Editar Carbohidrato

# carbItemForm_general_information
source: General Information
ca: Informació general
es: Información General

# carbItemForm_label_brand
source: Brand
ca: Marca
es: Marca

# carbItemForm_label_caffeine
source: Caffeine (mg)
ca: Cafeïna (mg)
es: Cafeína (mg)

# carbItemForm_label_carb_type
source: Carb Type
ca: Tipus de carbohidrat
es: Tipo de carbohidrato

# carbItemForm_label_carbohydrates
source: Carbohydrates (g)
ca: Hidrats de carboni (g)
es: Hidratos de carbono (g)

# carbItemForm_label_product_name
source: Product Name
ca: Nom del producte
es: Nombre del producto

# carbItemForm_label_sodium
source: Sodium (mg)
ca: Sodi (mg)
es: Sodio (mg)

# carbItemForm_label_water_volume
source: Water Volume (ml)
ca: Volum d’aigua (ml)
es: Volumen de agua (ml)

# carbItemForm_new_carb_item
source: New Carbohydrate
ca: Nou Hidrat de Carboni
es: Nuevo Carbohidrato

# carbItemForm_nutritional_information
source: Nutritional Information
ca: Informació Nutricional
es: Información Nutricional

# carbItemForm_placeholder_brand
source: e.g. Maurten
ca: p. ex. Maurten
es: p. ej. Maurten

# carbItemForm_placeholder_caffeine
source: e.g. 100
ca: p. ex. 100
es: p. ej. 100

# carbItemForm_placeholder_carbohydrates
source: e.g. 25
ca: p. ex. 25
es: p. ej. 25

# carbItemForm_placeholder_product_name
source: e.g. Maurten Gel 100
ca: p. ex. Maurten Gel 100
es: p. ej. Maurten Gel 100

# carbItemForm_placeholder_sodium
source: e.g. 200
ca: p. ex. 200
es: p. ej. 200

# carbItemForm_placeholder_water_volume
source: e.g. 500
ca: p. ex. 500
es: p. ej. 500

# carbItems_all_items_section_title
source: Suggested
ca: Suggerits
es: Sugeridos

# carbItems_caffeine_label
source: Caffeine:
ca: Cafeïna:
es: Cafeína:

# carbItems_carbs_label
source: Carbohydrates:
ca: Hidrats de carboni:
es: Carbohidratos:

# carbItems_sodium_label
source: Sodium:
ca: Sodi:
es: Sodio:

# carbItems_title
source: Carbohydrates
ca: Hidrats de carboni
es: Hidratos de carbono

# carbItems_user_items_section_title
source: Your carbohydrates
ca: Els teus hidrats de carboni
es: Tus hidratos de carbono

# carbItems_volume_label
source: Water volume:
ca: Volum d’aigua:
es: Volumen de agua:

# carbItems-type-drink
source: Drink
ca: Beguda
es: Bebida

# carbItems-type-other
source: Other
ca: Altres
es: Otros

# carbItems-type-solid
source: Solid
ca: Sòlid
es: Sólido

source: Continue
ca: Continuar
es: Continuar

source: Delete
ca: Elimina
es: Eliminar

source: Done
ca: Fet
es: Hecho

source: Edit
ca: Edita
es: Editar

# errors_carb-items-duplicate-item
source: This item is already in your list.
ca: Aquest element ja és a la teva llista.
es: Este elemento ya está en tu lista.

# errors_carb-items-loading-failed
source: We couldn’t load carb items. Please try again.
ca: No hem pogut carregar els hidrats de carboni. Torna-ho a provar.
es: No pudimos cargar los alimentos con carbohidratos. Inténtalo de nuevo.

# errors_fueling-plan-delete-failed
source: Couldn't delete the plan. Please try again.
ca: No s'ha pogut eliminar el pla. Torna-ho a intentar.
es: No se pudo eliminar el plan. Inténtalo de nuevo.

# errors_fueling-plan-duplicate-item
source: This plan already exists
ca: Aquest pla ja existeix
es: Este plan ya existe

# errors_fueling-plan-save-failed
source: Couldn't save the plan. Please try again.
ca: No s’ha pogut desar el pla. Torna-ho a provar.
es: No se pudo guardar el plan. Inténtalo de nuevo.

# errors_generic
source: Something went wrong. Please try again.
ca: Alguna cosa no ha anat bé. Torna-ho a provar.
es: Algo salió mal. Inténtalo de nuevo.

# formErrors_between_min_and_max
source: Must be between %.0f and %.0f
ca: Ha d’estar entre %.0f i %.0f
es: Debe estar entre %.0f y %.0f

# formErrors_bigger_than_min
source: Must be %.0f or bigger
ca: Ha de ser %.0f o més gran
es: Debe ser %.0f o mayor

# formErrors_invalid_format
source: Invalid format
ca: Format invàlid
es: Formato no válido

# formErrors_invalid_number
source: Invalid number
ca: Número invàlid
es: Número no válido

# formErrors_out_of_range
source: Out of range
ca: Fora de rang
es: Fuera de rango

# formErrors_required_field
source: This field is required
ca: Aquest camp és obligatori
es: Este campo es obligatorio

# formErrors_smaller_than_max
source: Must be %.0f or smaller
ca: Ha de ser %.0f o més petit
es: Debe ser %.0f o menor

# fueling_profile_information_description
source: Amateur applies conservative caps. Trained gut raises the cap for athletes who've adapted their digestion. No limits removes all caps.
ca: Amateur aplica límits conservadors. Estómac entrenat augmenta el límit per a atletes que han adaptat la digestió. Sense límits elimina totes les restriccions.
es: Amateur aplica límites conservadores. Estómago entrenado sube el límite para atletas que han adaptado su digestión. Sin límites elimina todas las restricciones.

# fueling_profile_title
source: Fueling profile
ca: Perfil de nutrició
es: Perfil de nutrición

# fueling_profile_trained
source: Trained gut
ca: Estómac entrenat
es: Estómago entrenado

# fueling_profile_uncapped
source: No limits
ca: Sense límits
es: Sin límites

source: Intensity
ca: Intensitat
es: Intensidad

# intensity_label_high
source: High (Z5+)
ca: Alta (Z5+)
es: Alta (Z5+)

# intensity_label_low
source: Low (Z1-Z2)
ca: Baixa (Z1–Z2)
es: Baja (Z1–Z2)

# intensity_label_medium
source: Moderate (Z3-Z4)
ca: Moderada (Z3–Z4)
es: Moderada (Z3–Z4)

source: OK
ca: D’acord
es: Aceptar

# paceCalculator_distance
source: Distance
ca: Distància
es: Distancia

# paceCalculator_duathlon-distance
source: Duathlon Distance:
ca: Distància Duatló:
es: Distancia Duatlón:

# paceCalculator_pace
source: Pace
ca: Ritme
es: Ritmo

# paceCalculator_race
source: Race
ca: Cursa
es: Carrera

# paceCalculator_speed
source: Speed
ca: Velocitat
es: Velocidad

# paceCalculator_time
source: Time
ca: Temps
es: Tiempo

# paceCalculator_total-time
source: Total time
ca: Temps total
es: Tiempo total

# paceCalculator_transitionX-time
source: Transition %d time
ca: Temps transició %d
es: Tiempo transición %d

# paceCalculator_triathlon-distance
source: Triathlon Distance:
ca: Distància Triatló:
es: Distancia Triatlón:

# paceCalculator_unit
source: Unit
ca: Unitat
es: Unidad

# race_nutrition_calculator-advanced-options
source: Advanced Options
ca: Opcions avançades
es: Opciones avanzadas

# race_nutrition_calculator-ambient-temperatur-information-description
source: Hotter conditions increase carb usage slightly. Your body relies more on carbs to maintain performance in heat.
ca: Les condicions més calentes augmenten lleugerament l’ús de carbohidrats. El cos depèn més dels carbohidrats per mantenir el rendiment amb calor.
es: Las condiciones más cálidas aumentan ligeramente el uso de carbohidratos. El cuerpo depende más de los carbohidratos para mantener el rendimiento con calor.

# race_nutrition_calculator-ambient-temperature
source: Ambient Temperature
ca: Temperatura ambient
es: Temperatura ambiente

# race_nutrition_calculator-ambient-temperature-c
source: Ambient Temperature (°C)
ca: Temperatura ambient (°C)
es: Temperatura ambiente (°C)

# race_nutrition_calculator-calculate-button-title
source: Calculate
ca: Calcula
es: Calcular

# race_nutrition_calculator-carbs-estimation-information-description
source: These recommendations are a guide, especially for athletes without gut training. Everyone’s tolerance is different, so it’s best to experiment and find what works for you.
ca: Aquestes recomanacions són una guia, especialment per a esportistes sense un estómac entrenat. La tolerància de cada persona és diferent, així que és millor provar i descobrir què funciona per a tu.
es: Estas recomendaciones son una guía, especialmente para deportistas sin un estómago entrenado. La tolerancia de cada persona es diferente, así que es mejor probar y descubrir qué funciona para ti.

# race_nutrition_calculator-carbs-estimation-information-title
source: Carbohydrate Intake Estimation
ca: Estimació d’ingesta de carbohidrats
es: Estimación de ingesta de carbohidratos

# race_nutrition_calculator-consumed-caffeine-before
source: Consumed caffeine before start
ca: Has pres cafeïna abans de començar
es: Has consumido cafeína antes de empezar

# race_nutrition_calculator-consumed-caffeine-before-information-description
source: Turn this on if you had caffeine before starting. This helps distribute in-session caffeine more effectively.
ca: Activa-ho si has pres cafeïna abans de començar. Això ajuda a repartir millor la cafeïna durant l’activitat.
es: Actívalo si has tomado cafeína antes de empezar. Esto ayuda a distribuir mejor la cafeína durante la sesión.

# race_nutrition_calculator-duration
source: Duration
ca: Durada
es: Duración

# race_nutrition_calculator-estimate-from-weight
source: Estimate
ca: Estimar
es: Estimar

# race_nutrition_calculator-estimated-carbs-per-hour
source: Estimated: %@ g/h
ca: Estimat: %@ g/h
es: Estimado: %@ g/h

# race_nutrition_calculator-estimated-total-carbs
source: Estimated Total Carbs
ca: Total d’hidrats estimat
es: Total de carbohidratos estimado

# race_nutrition_calculator-fasted-state
source: Fasted State
ca: Estat en dejú
es: Estado en ayunas

# race_nutrition_calculator-fasted-state-information-description
source: Your body burns more fat when you haven’t eaten before the effort, so your carb needs are lower. Use this if you start the session without a meal.
ca: El teu cos utilitza més greix si no has menjat abans de l’esforç, així que les necessitats de carbohidrats són més baixes. Fes servir-ho si comences la sessió sense menjar.
es: Tu cuerpo quema más grasa si no has comido antes del esfuerzo, por lo que tus necesidades de carbohidratos son menores. Úsalo si empiezas la sesión sin comer.

# race_nutrition_calculator-first-section-title
source: 1. Select your sport and race duration
ca: 1. Selecciona el teu esport i la durada de la cursa
es: 1. Selecciona tu deporte y la duración de la carrera

# race_nutrition_calculator-grams-per-hour
source: Carbs (g/h)
ca: Hidrats (g/h)
es: Carbohidratos (g/h)

# race_nutrition_calculator-grams-per-hour-estimate-select-sport-error
source: Please select a sport before estimating carbs per hour.
ca: Si us plau, selecciona un esport abans d’estimar els carbohidrats per hora.
es: Por favor, selecciona un deporte antes de estimar los carbohidratos por hora.

# race_nutrition_calculator-no-carbs-needed-description
source: Your glycogen stores are enough for this session. If you still want to fuel, set a custom amount manually.
ca: Les teves reserves de glucogen són suficients per a aquesta sessió. Si tot i així ho vols, introdueix una quantitat manualment.
es: Tus reservas de glucógeno son suficientes para esta sesión. Si aun así quieres, introduce una cantidad manualmente.

# race_nutrition_calculator-no-carbs-needed-title
source: No carbs needed for this duration
ca: No calen carbohidrats per a aquesta durada
es: No necesitas carbohidratos para esta duración

# race_nutrition_calculator-pace-calculator-select-sport-error
source: Please select a sport before using the time calculator.
ca: Si us plau, selecciona un esport abans d’utilitzar el calculador de temps.
es: Por favor, selecciona un deporte antes de usar la calculadora de tiempo.

# race_nutrition_calculator-second-section-title
source: 2. Enter your target carb intake (g/h), or estimate it from your weight and effort level.
ca: 2. Introdueix la teva ingesta objectiu d’hidrats (g/h) o calcula-la segons el teu pes i nivell d’esforç.
es: 2. Introduce tu ingesta objetivo de carbohidratos (g/h) o cálculala según tu peso y nivel de esfuerzo.

# race_nutrition_calculator-select-sport
source: Select Sport
ca: Selecciona esport
es: Selecciona deporte

# race_nutrition_calculator-start-eating-at
source: Start carb intake at
ca: Comença la ingesta d’hidrats a
es: Inicia la ingesta de carbohidratos en

# race_nutrition_calculator-start-eating-at-information-description
source: Set when you want to begin your carb intake during the session.
ca: Defineix quan vols començar la ingesta d’hidrats durant l’activitat.
es: Define cuándo quieres empezar la ingesta de carbohidratos durante la sesión.

# race_nutrition_calculator-sub-title
source: Estimate your carbohydrate needs based on race time, effort, or direct carb input.
ca: Calcula les teves necessitats d’hidrats de carboni segons el temps de cursa, l’esforç o una entrada directa.
es: Calcula tus necesidades de carbohidratos según el tiempo de carrera, el esfuerzo o una entrada directa.

# race_nutrition_calculator-title
source: Race Fueling Calculator
ca: Calculadora d’avituallament de cursa
es: Calculadora de nutrición en carrera

# race_nutrition_calculator-use-time-calculator
source: Use Time Calculator
ca: Utilitza el calculador de temps
es: Usar calculadora de tiempo

# race_nutrition_calculator-weight-kg
source: Weight (kg)
ca: Pes (kg)
es: Peso (kg)

# race_nutrition_results-edit-view-apply-button-label
source: Apply Changes
ca: Aplicar Canvis
es: Aplicar cambios

# race_nutrition_results-edit-view-hourly-breakdown-title
source: Hourly breakdown
ca: Desglossament per hora
es: Desglose por hora

# race_nutrition_results-edit-view-reset-button-label
source: Reset
ca: Restablir
es: Restablecer

# race_nutrition_results-fueling-plan-drink-column-title
source: Drink
ca: Beguda
es: Bebida

# race_nutrition_results-fueling-plan-edit-button-label
source: Edit
ca: Editar
es: Editar

# race_nutrition_results-fueling-plan-hourly-breakdown-title
source: Hourly breakdown
ca: Desglossament per hora
es: Desglose por hora

# race_nutrition_results-fueling-plan-item-column-title
source: Item
ca: Element
es: Elemento

# race_nutrition_results-fueling-plan-selected-carbs-hour-target-label
source: Selected Carbs per Hour/Target:
ca: Carbohidrats seleccionats per hora / Objectiu:
es: Carbohidratos seleccionados por hora / Objetivo:

# race_nutrition_results-fueling-plan-selected-carbs-target-label
source: Selected Carbs/Target:
ca: Carbohidrats seleccionats / Objectiu:
es: Carbohidratos seleccionados / Objetivo:

# race_nutrition_results-fueling-plan-selected-nutrition-items-title
source: Selected Nutrition Items
ca: Elements de nutrició seleccionats
es: Elementos de nutrición seleccionados

# race_nutrition_results-fueling-plan-time-column-title
source: Time
ca: Temps
es: Tiempo

# race_nutrition_results-fueling-plan-title
source: Fueling plan
ca: Pla d’avituallament
es: Plan de avituallamiento

# race_nutrition_results-instant-events-title
source: Instant fueling events
ca: Esdeveniments d’avituallament instantani
es: Eventos de avituallamiento instantáneo

# race_nutrition_results-interval-caffeine-label
source: Caffeine:
ca: Cafeïna:
es: Cafeína:

# race_nutrition_results-interval-carbs-label
source: Carbs:
ca: Carbohidrats:
es: Carbohidratos:

# race_nutrition_results-interval-events-title
source: Interval fueling events
ca: Esdeveniments d’avituallament per intervals
es: Eventos de avituallamiento por intervalo

# race_nutrition_results-interval-liquid-label
source: Liquid:
ca: Líquid:
es: Líquido:

# race_nutrition_results-save-plan-button-hint
source: Save this nutrition plan
ca: Desar aquest pla de nutrició
es: Guardar este plan de nutrición

# race_nutrition_results-save-plan-button-label
source: Save plan
ca: Desa el pla
es: Guardar plan

# race_nutrition_results-save-plan-name-placeholder
source: Plan name
ca: Nom del pla
es: Nombre del plan

# race_nutrition_results-save-success-toast-message
source: Plan saved
ca: Pla desat
es: Plan guardado

# race_nutrition_results-stored-plans-item-duration-label
source: Duration
ca: Durada
es: Duración

# race_nutrition_results-stored-plans-item-unnamed-plan
source: Unnamed plan
ca: Pla sense nom
es: Plan sin nombre

# race_nutrition_results-stored-plans-no-stored-plans
source: No stored plans
ca: No hi ha plans desats
es: No hay planes guardados

# race_nutrition_results-stored-plans-title
source: Stored fueling plans
ca: Plans d'alimentació desats
es: Planes de alimentación guardados

# raceDistance_duathlon-long
source: Long distance (10k-150k-30k)
ca: Distància llarga (10k-150k-30k)
es: Distancia larga (10k-150k-30k)

# raceDistance_duathlon-middle
source: Middle distance (10k-60k-10k)
ca: Mitja distància (10k-60k-10k)
es: Media distancia (10k-60k-10k)

# raceDistance_duathlon-standard
source: Standard (10k-40k-5k)
ca: Estàndard (10k-40k-5k)
es: Estándar (10k-40k-5k)

# raceDistance_half-marathon
source: Half marathon
ca: Mitja marató
es: Medio maratón

# raceDistance_marathon
source: Marathon
ca: Marató
es: Maratón

# raceDistance_triathlon-full
source: Full distance (Ironman)
ca: Distància full (Ironman)
es: Distancia full (Ironman)

# raceDistance_triathlon-middle
source: Middle distance (Half Ironman)
ca: Mitja distància (Half Ironman)
es: Media distancia (Half Ironman)

# raceDistance_triathlon-olympic
source: Olympic
ca: Olimpíc
es: Olímpico

source: Remove from favorites
ca: Treu dels preferits
es: Quitar de favoritos

source: Reset
ca: Restableix
es: Restablecer

source: Save
ca: Desa
es: Guardar

# splits_table-by-distance
source: By distance
ca: Per distància
es: Por distancia

# splits_table-column-name-cumulative-time
source: Cumulative time
ca: Temps acumulat
es: Tiempo acumulado

# splits_table-column-name-distance
source: Distance
ca: Distància
es: Distancia

# splits_table-column-name-split-time
source: Split time
ca: Temps parcial
es: Tiempo parcial

# splits_table-title
source: Splits
ca: Parcials
es: Parciales

source: Sport
ca: Esport
es: Deporte

# sports_cycling
source: Cycling
ca: Ciclisme
es: Ciclismo

# sports_duathlon
source: Duathlon
ca: Duatló
es: Duatlón

# sports_swimming
source: Swimming
ca: Natació
es: Natación

# sports_triathlon
source: Triathlon
ca: Triatló
es: Triatlón

# tabs_calculator
source: Pace Calculator
ca: Calculadora Ritmes
es: Calculadora de Ritmo

# tabs_my_athlete_profile
source: Athlete Profile
ca: Perfil de l'Atleta
es: Perfil del Atleta

# tabs_sport_nutrition
source: Sport Nutrition
ca: Nutrició Esport
es: Nutrición Deporte

# race_nutrition_results-fueling-plan-interval-column-title
source: Interval
es: Intervalo

# race_nutrition_results-interval-breakdown-interval
source: Interval %@
es: Intervalo %@

# race_nutrition_results-stored-plans-item-grams-hour-label
source: Grams/h
es: Gramos/h
